class Class17 {  
  public static void main(String args[]) { 
    System.out.println("將262904713字串轉換short時，會顯示以下錯誤:java.lang.NumberFormatException(數字格式異常)，主要是short空間為16位元(65536)，但因含正負值，所以正值最大為"+Short.parseShort("32767")+"再上去就會顯示錯誤");
  } 
}

/*output--------------------------------------------------------------------------------------------------------------------------------------------------------------
將262904713字串轉換short時，會顯示以下錯誤:java.lang.NumberFormatException(數字格式異常)，主要是short空間為16位元(65536)，但因含正負值，所以正值最大為32767再上去就會顯示錯誤
--------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
